<?php

// في هذه الصفحة بنعرف الفانكشنات الي رح نستخدمها في كل الشغل


// اول فانكشن هي فانكشن مهمتها تحط عنوان الصفحة فوق في المتصفح 

function getTitle()
{
    global $pageTitle;  // بنعملو قلوبال عشان يمكن رايته من اي مكان
        
    if(isset($pageTitle))
    {
        echo $pageTitle;
        
    }else
        
      { echo 'Defult'; }
        
        
}



// هنا بدنا نعمل فنكشن مهمتها بس انو تحط رسالة الايرور بداخلها  وعدد ثواني ظهورها وفي حال صار اي خطا معك بتروح الفنكشن هاد بتقلك شو الغلط وبتحولك بعد عدد معين من الثواني لصفحة الرئيسية

function redirecthome($themsg, $url=null ,$seconds = 3)
{
    if($url === null){ // يعني لو انو المستخدم ساب اليوارل فاضية محطش فيها صفحة
        
        $url ='index.php';  // لو كانت فاضية حولو عالاندكس
        $link = 'Home Page';
    }else {
        if (isset($_SERVER['HTTP_REFERER']) && $_SERVER['HTTP_REFERER'] !== '')
        {
         $url = $_SERVER['HTTP_REFERER']; // لو مكنتش فاضية حولو عالصفحة لهو جا منها
             $link = 'previce Page';
        }else{
                $url = 'index.php';
             $link = 'Home Page';
             }
       
            
       
    }
    echo $themsg; // هنا طبعنا رسالة الخطا
     echo "<div class='alert alert-info'>you will redirect to $link after $seconds seconds.</div>"; // هنا حكنالو قديش بدك ثواني لننقلك للصفحة الرئيسية
    header("refresh:$seconds;url=$url"); // طبعا لاحظ هنا استخدمنا رفريش بدل لوكيشن وذلك عشانا مستخدمين سكند يعني بنستخدم رفريش مع الوقت 
    exit();//وبعد كل هيدر زي متفنا لازم نستخدم اكست
}


/* هان بدنا نعمل فنكشن مهمتها تروح تعمل شيك عالداتا وتشوف مثلا اسم المستخدم لانا بدخلو موجود في الداتا ولا لا اذا كان موجود بقلك بنفعش تدخل اسم مستخدم موجود من قبل وان كان مش موجود بدخلو
**الفنكشن هاد عشان تشتغل بتحتاج باراميتر وهي كالتالي
** أول حاجة بدها تعمل سيلكت على عنصر وهاذا العنصر هو اول باراميتر
** ثاني شغلة بدها تبحث بجدول البيانات إذا اسم الجدول لبدو ينبحث في هو متغير ثاني
** القيمة لبترجع من عملية البحث هي تعتبر الماغير الثالث للفنكشن
** نبلش بناء الفنكشن على بركة الله
*/ 

function checkitem($select , $from , $value)
{
    global $con ; // عملنا متغير الكون قلوبال عشان يسير من الممكن رايته من اي مكان
    
    $statment = $con->prepare("SELECT $select FROM $from WHERE $select = ? ");
    
    $statment->execute(array($value)); // عشان يفهم انو علامة الاستفهام بتعني قيمة الفاليو
    
    $cont  = $statment->rowCount(); // احسب عدد الاسطر المتغيرة
    
    return $cont; // انتبه هنا كنت حاطط ايكو وبدلناها بريتيرن طيب ليش (لانو الايكو بيطبع رقم واحد عالشاشة وخلص ونا مبديش يطبعلي رقم انا بدي يرحعلي بالفكنشن القيمة يقلي واحد ولا صفر يعني في تغيير ولا لا وانا لمن اروح استخدم الفنكشن بالمكان لبدي يا بقلو بناء على الرتيرن شو بدي تطبعلي)
}


/* هنا بدنا نعمل فنكشن لحساب عدد عناصر معينة من الداتا مثل عدد المستخدمين الموجودين او المنتجات الموجودة
** الفنكشن حتاخد متغيرات واول متغير هو الايتم لبدنا نحسب عددو
** تاني متغير رح يكون هو الجدول لبدنا نحسب منو او نشيك علي
*/

function getcount($item , $table)
{
    global $con;  // عملنا الكون قلوبال عشان ينشاف برا الفنكشن
    
     $stmt2 = $con->prepare("SELECT COUNT($item) FROM $table"); // هنا رحنا استعرضنا عدد المستخدمين بناء على ارقامهم
     $stmt2->execute(); // قلنالو هان نفذ يمعلم
     
     return $stmt2->fetchColumn(); // وهان حكتلو خزن القيمة ورجعها 
}


/* هنا بدنا نعمل فانكشن بتجيب اخر اسماء او منتجات تم اضافتهم في جداولهم
**
**
**
*/

function lastitem($select , $table , $odrder , $limit = 5)
{
    global $con;
    //طبعا الدالة ستمت3 هاد من راسي وبعدين حطيت فيها جملة كويري بتروح بتشيك عالداتا وبتبحث عن اخر 5 عناصر معينة ومرتبات حسب منت بتعطي الامر عند متستخدم الفنكشن طبعا ال5 افتراضية ممكن تتغير
    $stmt3 = $con->prepare("SELECT $select FROM $table ORDER BY $odrder DESC LIMIT $limit ");
    $stmt3->execute();
     $rows = $stmt3->fetchAll();
    return $rows;
}